src/config/Reports/АнализТочкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализТочкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/InformationRegisters/ЗначенияТочкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияТочкиЗаказа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОпределенияЗначенияТочкиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияЗначенияТочкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТочкиЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйСтраховойЗапас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавкаЗначенияТочкиЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавкаМинимальногоСтраховогоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/СпособыОпределенияЗначенияТочкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияЗначенияТочкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийРазмерПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптимальныйРазмерЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтавкуНДС</Name>
					<Comment>Используется при формировании ОРП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Грузоотправитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Основной Склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДляОтгрузкиИзЯрославля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВБюджете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСборкиИМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРазборкиИМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Comment>участвует в планировании</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Reports/АнализТочкиЗаказа/Ext/ObjectModule.bsl
Перем ТекстЗапросаСОтборомПоПодразделению, ТекстЗапросаПустоеПодразделение Экспорт;

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	СтруктураПредставлениеПолей = Новый Структура;
	МассивОтбора = Новый Массив;
	ОбщийОтчет.мСоответствиеНазначений = Новый Соответствие;
	ОбщийОтчет.мСтруктураДляОтбораПоКатегориям = Новый Структура;
	
	ПостроительОтчета.Параметры.Вставить("Фиксированная", Перечисления.СпособыОпределенияЗначенияТочкиЗаказа.Фиксированная);
	ПостроительОтчета.Параметры.Вставить("СреднийРазмерПартии", Перечисления.СпособыОпределенияЗначенияТочкиЗаказа.СреднийРазмерПартии);
	ПостроительОтчета.Параметры.Вставить("ОптимальныйРазмерЗаказа", Перечисления.СпособыОпределенияЗначенияТочкиЗаказа.ОптимальныйРазмерЗаказа);
	ПостроительОтчета.Параметры.Вставить("НеКонтролировать", Перечисления.СпособыОпределенияЗначенияТочкиЗаказа.НеКонтролировать);
	ПостроительОтчета.Параметры.Вставить("ПустоеПодразделение", Справочники.Подразделения.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("ПустойСклад", Справочники.Склады.ПустаяСсылка());

	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Номенклатура");
	
	 	
	ПостроительОтчета.Текст = ТекстЗапросаПустоеПодразделение;
	
	//Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
	//	
	//	УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);
	//	
	//КонецЕсли;
	
	Если ОбщийОтчет.Показатели.Найти("ЗначениеТочкиЗаказа", "Имя") = Неопределено Тогда
		
		ОбщийОтчет.ЗаполнитьПоказатели("ЗначениеТочкиЗаказа", "Значение точки заказа", истина, "ЧЦ=15; ЧДЦ=3");
		
	КонецЕсли;
	
	//Если ОбщийОтчет.Показатели.Найти("МинимальныйСтраховойЗапас", "Имя") = Неопределено Тогда
	//	
	//	ОбщийОтчет.ЗаполнитьПоказатели("МинимальныйСтраховойЗапас", "Минимальный страховой запас", истина, "ЧЦ=15; ЧДЦ=3");
	//	
	//КонецЕсли;
	
	Если ОбщийОтчет.Показатели.Найти("Остаток", "Имя") = Неопределено Тогда
		
		ОбщийОтчет.ЗаполнитьПоказатели("Остаток", "Остаток", истина, "ЧЦ=15; ЧДЦ=3");
		
	КонецЕсли;
	
	Если ОбщийОтчет.Показатели.Найти("КоличествоПроделено", "Имя") = Неопределено Тогда
		
		ОбщийОтчет.ЗаполнитьПоказатели("КоличествоПроделено", "Количество проделено", истина, "ЧЦ=15; ЧДЦ=3");
		
	КонецЕсли;

	Если ОбщийОтчет.Показатели.Найти("КоличествоЗаказано", "Имя") = Неопределено Тогда
		
		ОбщийОтчет.ЗаполнитьПоказатели("КоличествоЗаказано", "Заказано у поставщика (ожидаемое поступление)", истина, "ЧЦ=15; ЧДЦ=3");
		
	КонецЕсли;

	
	Если ОбщийОтчет.Показатели.Найти("НеобходимыйОбъемЗакупки", "Имя") = Неопределено Тогда
		
		ОбщийОтчет.ЗаполнитьПоказатели("НеобходимыйОбъемЗакупки", "Необходимый объем закупки", истина, "ЧЦ=15; ЧДЦ=3");
		
	КонецЕсли;
	
		
	ОбщийОтчет.мНазваниеОтчета = "Анализ точки заказа";
	
	ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.мРежимВводаПериода = 1;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений = Новый Структура("СрокДоставки", Новый Структура("Номенклатура, ХарактеристикаНоменклатуры"));
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт
	
	Если ЗначениеНеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
		
		ОбщийОтчет.ДатаКон = ТекущаяДата();
		
	КонецЕсли;
	//ОтборПодразделение=ОбщийОтчет.ПостроительОтчета.Отбор.Найти("Подразделение");
	//
	//Если ОтборПодразделение.Использование И Не ЗначениеНеЗаполнено(ОтборПодразделение.Значение) Тогда //И  ОбщийОтчет.ПостроительОтчета.Текст=ТекстЗапросаПустоеПодразделение Тогда
	//	
	//	ОбщийОтчет.ПостроительОтчета.Текст=ТекстЗапросаСОтборомПоПодразделению ;
	//	
	//Иначе		
	//	ОбщийОтчет.ПостроительОтчета.Текст=ТекстЗапросаПустоеПодразделение ;
	//КонецЕсли;	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

 // для Филиалов
    ТекстЗапросаСОтборомПоПодразделению = "ВЫБРАТЬ
	 | ВложенныйЗапрос.Номенклатура Номенклатура,
	 |  СУММА(ЗначениеТочкиЗаказа) ЗначениеТочкиЗаказа, СУММА(Остаток) Остаток, СУММА(КоличествоПроделено) КоличествоПроделено, СУММА(КоличествоЗаказано) КоличествоЗаказано, СУММА(НеобходимыйОбъемЗакупки)  НеобходимыйОбъемЗакупки
	 | {ВЫБРАТЬ ВложенныйЗапрос.Номенклатура.* КАК Номенклатура}
	 | ИЗ
	 | (ВЫБРАТЬ
	 |   		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	 |   		ВложенныйЗапрос.ЗначениеТочкиЗаказа КАК ЗначениеТочкиЗаказа,
	 |   		ВложенныйЗапрос.Остаток КАК Остаток,
	 |   		ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0) КоличествоПроделено,
	 |			0 КоличествоЗаказано,
	 |	ВЫБОР КОГДА ВложенныйЗапрос.ЗначениеТочкиЗаказа > ВложенныйЗапрос.Остаток -ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0) ТОГДА
	 |		ВложенныйЗапрос.ЗначениеТочкиЗаказа - ВложенныйЗапрос.Остаток+ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0)
	 |	ИНАЧЕ
	 |		0
	 |	КОНЕЦ КАК НеобходимыйОбъемЗакупки
	 |   	ИЗ (ВЫБРАТЬ
	 |   			ЗначенияТочкиЗаказа.Номенклатура КАК Номенклатура,
	 |   			ЗначенияТочкиЗаказа.ЗначениеТочкиЗаказа КАК ЗначениеТочкиЗаказа,
	 |   			ЕстьNULL(ТоварыНаСкладах.КоличествоОстаток,0) КАК Остаток
	 |   		ИЗ
	 |   		РегистрСведений.ЗначенияТочкиЗаказа.СрезПоследних(&ДатаКон, Подразделение <> &ПустоеПодразделение {Номенклатура.* } ) КАК ЗначенияТочкиЗаказа
	 |   				
	 |   			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон, {Номенклатура.*} Склад.Транзитный ) КАК ТоварыНаСкладах
	 |   			ПО ЗначенияТочкиЗаказа.Номенклатура = ТоварыНаСкладах.Номенклатура 
	 |  ГДЕ  ЗначенияТочкиЗаказа.СпособОпределенияЗначенияТочкиЗаказа = &Фиксированная
	 |   		) КАК ВложенныйЗапрос
	 |   			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаКон, 
	 |  ЗаказПокупателя.Проверен И  ЗаказПокупателя.Транзит {Номенклатура.*} 
	 |) КАК ЗаказыПокупателей
	 |   			ПО ВложенныйЗапрос.Номенклатура = ЗаказыПокупателей.Номенклатура ) ВложенныйЗапрос
	 | СГРУППИРОВАТЬ ПО Номенклатура
	 |ИТОГИ СУММА(Остаток), СУММА(ЗначениеТочкиЗаказа), 
	 |СУММА(НеобходимыйОбъемЗакупки), СУММА(КоличествоПроделено), СУММА(КоличествоЗаказано) 
	 |	ПО ОБЩИЕ,
	 |	ВложенныйЗапрос.Номенклатура
	 |{УПОРЯДОЧИТЬ ПО
	 |	ВложенныйЗапрос.Номенклатура.*
	 |//СВОЙСТВА_ОБЩИЕ
	 |}
	 |{ИТОГИ ПО
	 |	ВложенныйЗапрос.Номенклатура.*
	 |//СВОЙСТВА_ОБЩИЕ
	 |} ";
	 
	 // для ЯШТ
	 ТекстЗапросаПустоеПодразделение = "ВЫБРАТЬ
	 | ВложенныйЗапрос.Номенклатура Номенклатура,
	 |  СУММА(ЗначениеТочкиЗаказа) ЗначениеТочкиЗаказа, СУММА(Остаток) Остаток, СУММА(КоличествоПроделено) КоличествоПроделено, СУММА(КоличествоЗаказано) КоличествоЗаказано, СУММА(НеобходимыйОбъемЗакупки)  НеобходимыйОбъемЗакупки
	 | {ВЫБРАТЬ ВложенныйЗапрос.Номенклатура.* КАК Номенклатура}
	 | ИЗ
	 |	(ВЫБРАТЬ
	 |   		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	 |   		ВложенныйЗапрос.ЗначениеТочкиЗаказа КАК ЗначениеТочкиЗаказа,
	 |   		ВложенныйЗапрос.Остаток КАК Остаток,
	 |   		ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0) КоличествоПроделено,
	 |   		ЕстьNULL(ЗаказыПоставщикам.КоличествоОстаток,0) КоличествоЗаказано,
	 |	ВЫБОР КОГДА ВложенныйЗапрос.ЗначениеТочкиЗаказа > ВложенныйЗапрос.Остаток -ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0) + ЕстьNULL(ЗаказыПоставщикам.КоличествоОстаток,0) ТОГДА
	 |		ВложенныйЗапрос.ЗначениеТочкиЗаказа - ВложенныйЗапрос.Остаток-ЕстьNULL(ЗаказыПоставщикам.КоличествоОстаток,0) +ЕстьNULL(ЗаказыПокупателей.КоличествоОстаток,0)
	 |	ИНАЧЕ
	 |		0
	 |	КОНЕЦ КАК НеобходимыйОбъемЗакупки
	 |   	ИЗ (ВЫБРАТЬ
	 |   			ЗначенияТочкиЗаказа.Номенклатура КАК Номенклатура,
	 |   			ЗначенияТочкиЗаказа.ЗначениеТочкиЗаказа КАК ЗначениеТочкиЗаказа,
	 |   			ЕстьNULL(ТоварыНаСкладах.КоличествоОстаток,0) КАК Остаток
	 |   		ИЗ
	 |   		РегистрСведений.ЗначенияТочкиЗаказа.СрезПоследних(&ДатаКон, Подразделение =&ПустоеПодразделение {Номенклатура.* } ) КАК ЗначенияТочкиЗаказа
	 |   				
	 |   			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон, {Номенклатура.*} НЕ Склад.Транзитный ) КАК ТоварыНаСкладах
	 |   			ПО ЗначенияТочкиЗаказа.Номенклатура = ТоварыНаСкладах.Номенклатура 
	 |  ГДЕ  ЗначенияТочкиЗаказа.СпособОпределенияЗначенияТочкиЗаказа = &Фиксированная
	 |   		) КАК ВложенныйЗапрос
	 |   			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(&ДатаКон, 
	 |   НЕ ЗаказПокупателя.Транзит {Номенклатура.*} 
	 |) КАК ЗаказыПокупателей
	 |   			ПО ВложенныйЗапрос.Номенклатура = ЗаказыПокупателей.Номенклатура
	 |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаКон,ЕСТЬNULL(Подразделение.ВЭД, ЛОЖЬ) = ЛОЖЬ и НЕ ЗаказПоставщику.Транзит) КАК ЗаказыПоставщикам
	 |				ПО ВложенныйЗапрос.Номенклатура = ЗаказыПоставщикам.Номенклатура) ВложенныйЗапрос
	 | СГРУППИРОВАТЬ ПО Номенклатура
	 |ИТОГИ СУММА(Остаток), СУММА(ЗначениеТочкиЗаказа), 
	 |СУММА(НеобходимыйОбъемЗакупки), СУММА(КоличествоПроделено), СУММА(КоличествоЗаказано) 
	 |	ПО ОБЩИЕ,
	 |	ВложенныйЗапрос.Номенклатура
	 |{УПОРЯДОЧИТЬ ПО
	 |	ВложенныйЗапрос.Номенклатура.*
	 |//СВОЙСТВА_ОБЩИЕ
	 |}
	 |{ИТОГИ ПО
	 |	ВложенныйЗапрос.Номенклатура.*
	 |//СВОЙСТВА_ОБЩИЕ
	 |} ";
